'''
Задача 3

В таблицата са дадени данни за населението на САЩ в периода 1920-1990.
Да се построи полином от седма степен, интерполиращ таблицата.
Да се даде приближение на населението през 1952, 1974, 2000 година
    и да се сравни с действителните стойности -- съответно 157 млн., 214 млн., 281.42 млн.
 Година 	1920 	1930 	1940 	1950 	1960 	1970 	1980 	1990
Население 	106.46 	123.08 	132.12 	152.27 	180.67 	205.05 	227.23 	249.46
'''

import numpy as np

from util.newton_poly import newton_poly

nodes = np.array([1920, 1930, 1940, 1950, 1960, 1970, 1980, 1990])
values = np.array([106.46, 123.08, 132.12, 152.27, 180.67, 205.05, 227.23, 249.46])

# ~~157.728 - very small mistake of 0.728
print("1952:", newton_poly(nodes, values, 1952))

# ~~213.510 - very small mistakke of 0.489
print("1974:", newton_poly(nodes, values, 1974))

# ~~175.080 - large mistake of 106.340 as 2000 is outside [nodes.min; nodes.max]
print("2000:", newton_poly(nodes, values, 2000))