'''
Характерно за някои видове химични реакции, зависещи от киселинността на средата,
    в която протичат е, че тази киселинност се изменя синусоидално в рамките на денонощието.
Такива са например някои каталитични процеси (напр. производството на биогорива),
    разлагане на органична материя от някои видове микроорганизми и др.
В таблицата са дадени измервания на киселинността в един химичен реактор в няколко момента от денононщието:

t, h 	  2 	5 	    7 	    11 	    14 	    16 	    18 	    21 	    24
pH 	      7 	7.1 	7.4 	8.2 	8.9 	8.4 	7.9 	7.3 	7

Да се интерполират данните от таблицата с обощен полином по подходяща система от функции. Като се използва така намерения полином, да се намери максималната стойност на pH в реактора и часът, в който тя се достига. Периодът на разглеждания процес е 24 часа.
'''

import numpy as np
import numpy.linalg
import matplotlib.pyplot as plt
import math

from util.basis_poly import *

nodes = np.array([2, 5, 7, 11, 14, 16, 18, 21, 24])
values = np.array([7, 7.1, 7.4, 8.2, 8.9, 8.4, 7.9, 7.3, 7])

nodes = transform_nodes_from_period(nodes, period := 24)

x_axis = np.linspace(np.min(nodes) - 4, np.max(nodes) + 5, 400)

plt.scatter(nodes, values)
plt.plot(x_axis, trig_poly(nodes, values, x_axis))
plt.legend(['points', 'trig poly'])
plt.show()